src/Catalogs/ПечатныеФормыWord.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормыWord</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектВладелец</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетWord</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМетоданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаКопии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры111</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизвольныйАлгоритм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ДинамическиеМакеты/Ext/Module.bsl
//Островская Татьяна 20.11.2013 № 16927
Процедура СформироватьПодменюМакеты(ЭтотОбъект, ЭлементыФормы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	| ПечатныеФормыWord.Код,
	| ПечатныеФормыWord.Наименование
	|ИЗ
	| Справочник.ПечатныеФормыWord КАК ПечатныеФормыWord
	|ГДЕ
	| ПечатныеФормыWord.ИмяМетоданных = &ИмяМетоданных
	| И ПечатныеФормыWord.ТипМетаданных = &ТипМетаданных";

	ИмяТаблицыОбъекта = "";
	МетаданныеОбъекта = ЭтотОбъект.Метаданные();
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("ТипМетаданных", "Документ");
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("ТипМетаданных", "Справочник");
	ИначеЕсли Метаданные.Отчеты.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("ТипМетаданных", "Отчет");
	Иначе
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИмяМетоданных", МетаданныеОбъекта.Имя);
	ВыборкаWord = Запрос.Выполнить().Выбрать();
	Если ВыборкаWord.Количество() Тогда
		КнопкаПодменю = ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Вставить(0, "ПодменюМакеты", ТипКнопкиКоманднойПанели.Подменю, "Макеты");
		КнопкаПодменю.Текст = "Печатные формы";
		КнопкаПодменю.Картинка = БиблиотекаКартинок.Печать;
		КнопкаПодменю.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
		КнопкаПодменю.Кнопки.Добавить();
		Если ВыборкаWord.Количество() Тогда
			ДействиеПечать = Новый Действие("ДействиеПолучитьДинамическийМакетWord");
			Пока ВыборкаWord.Следующий() Цикл
				КнопкаПодменю.Кнопки.Добавить("Имя" + ВыборкаWord.Код, ТипКнопкиКоманднойПанели.Действие, ВыборкаWord.Наименование, ДействиеПечать);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
